2024-1-10/f8a35943e1-STDY.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-05-22 Wed 16:46 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>PPC和非PPC(arm,x86,etc.)中OF创建platform_device之间的不同</title>
<meta name="author" content="Yang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">PPC和非PPC(arm,x86,etc.)中OF创建platform_device之间的不同</h1>
<p>
非PPC方案中，在driver/of/platform.c文件中，有如下开始创建platform_device的入口：
</p>
<div class="org-src-container">
<pre class="src src-c">  <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">__init</span> of_platform_default_populate_init(<span style="font-weight: bold; text-decoration: underline;">void</span>)
  {
          <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">device_node</span> *<span style="font-weight: bold; font-style: italic;">node</span>;

          device_links_supplier_sync_state_pause();

          <span style="font-weight: bold;">if</span> (!of_have_populated_dt())
                  <span style="font-weight: bold;">return</span> -ENODEV;

          <span style="font-weight: bold; font-style: italic;">/*</span>
<span style="font-weight: bold; font-style: italic;">           * Handle certain compatibles explicitly, since we don't want to create</span>
<span style="font-weight: bold; font-style: italic;">           * platform_devices for every node in /reserved-memory with a</span>
<span style="font-weight: bold; font-style: italic;">           * "compatible",</span>
<span style="font-weight: bold; font-style: italic;">           */</span>
          for_each_matching_node(node, reserved_mem_matches)
                  of_platform_device_create(node, <span style="font-weight: bold; text-decoration: underline;">NULL</span>, <span style="font-weight: bold; text-decoration: underline;">NULL</span>);

          node = of_find_node_by_path(<span style="font-style: italic;">"/firmware"</span>);
          <span style="font-weight: bold;">if</span> (node) {
                  of_platform_populate(node, <span style="font-weight: bold; text-decoration: underline;">NULL</span>, <span style="font-weight: bold; text-decoration: underline;">NULL</span>, <span style="font-weight: bold; text-decoration: underline;">NULL</span>);
                  of_node_put(node);
          }

          <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">Populate everything else.</span><span style="font-weight: bold; font-style: italic;"> */</span>
          fw_devlink_pause();
          of_platform_default_populate(<span style="font-weight: bold; text-decoration: underline;">NULL</span>, <span style="font-weight: bold; text-decoration: underline;">NULL</span>, <span style="font-weight: bold; text-decoration: underline;">NULL</span>); <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#24377;&#20986;&#25152;&#26377;&#20869;&#23481;&#65292;&#25384;&#20010;&#21019;&#24314;platform_device&#65292;&#25918;&#21040;/sys/bus/platform/devices/&#30446;&#24405;&#19979;</span>
          fw_devlink_resume();

          <span style="font-weight: bold;">return</span> 0;
  }
  <span style="font-weight: bold;">arch_initcall_sync</span>(of_platform_default_populate_init); <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">level: 3</span>

</pre>
</div>

<p>
PPC方案中，入口点在/arch/powerpc/platforms/powernv/opal.c文件中：
</p>
<div class="org-src-container">
<pre class="src src-c">  <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">__init</span> opal_init(<span style="font-weight: bold; text-decoration: underline;">void</span>)
{
        <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">device_node</span> *<span style="font-weight: bold; font-style: italic;">np</span>, *<span style="font-weight: bold; font-style: italic;">consoles</span>, *<span style="font-weight: bold; font-style: italic;">leds</span>;
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">rc</span>;

        opal_node = of_find_node_by_path(<span style="font-style: italic;">"/ibm,opal"</span>);
        <span style="font-weight: bold;">if</span> (!opal_node) {
                pr_warn(<span style="font-style: italic;">"Device node not found\n"</span>);
                <span style="font-weight: bold;">return</span> -ENODEV;
        }

        <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">Register OPAL consoles if any ports</span><span style="font-weight: bold; font-style: italic;"> */</span>
        consoles = of_find_node_by_path(<span style="font-style: italic;">"/ibm,opal/consoles"</span>);
        <span style="font-weight: bold;">if</span> (consoles) {
                for_each_child_of_node(consoles, np) {
                        <span style="font-weight: bold;">if</span> (!of_node_name_eq(np, <span style="font-style: italic;">"serial"</span>))
                                <span style="font-weight: bold;">continue</span>;
                        of_platform_device_create(np, <span style="font-weight: bold; text-decoration: underline;">NULL</span>, <span style="font-weight: bold; text-decoration: underline;">NULL</span>);
                }
                of_node_put(consoles);
        }

        <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">Initialise OPAL messaging system</span><span style="font-weight: bold; font-style: italic;"> */</span>
        opal_message_init(opal_node);

        <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">Initialise OPAL asynchronous completion interface</span><span style="font-weight: bold; font-style: italic;"> */</span>
        opal_async_comp_init();

        <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">Initialise OPAL sensor interface</span><span style="font-weight: bold; font-style: italic;"> */</span>
        opal_sensor_init();

        <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">Initialise OPAL hypervisor maintainence interrupt handling</span><span style="font-weight: bold; font-style: italic;"> */</span>
        opal_hmi_handler_init();

        <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">Create i2c platform devices</span><span style="font-weight: bold; font-style: italic;"> */</span>
        opal_pdev_init(<span style="font-style: italic;">"ibm,opal-i2c"</span>);

        <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">Handle non-volatile memory devices</span><span style="font-weight: bold; font-style: italic;"> */</span>
        opal_pdev_init(<span style="font-style: italic;">"pmem-region"</span>);

        <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">Setup a heatbeat thread if requested by OPAL</span><span style="font-weight: bold; font-style: italic;"> */</span>
        opal_init_heartbeat();

        <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">Detect In-Memory Collection counters and create devices</span><span style="font-weight: bold; font-style: italic;">*/</span>
        opal_imc_init_dev();

        <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">Create leds platform devices</span><span style="font-weight: bold; font-style: italic;"> */</span>
        leds = of_find_node_by_path(<span style="font-style: italic;">"/ibm,opal/leds"</span>);
        <span style="font-weight: bold;">if</span> (leds) {
                of_platform_device_create(leds, <span style="font-style: italic;">"opal_leds"</span>, <span style="font-weight: bold; text-decoration: underline;">NULL</span>);
                of_node_put(leds);
        }

<span style="font-weight: bold;">        #if</span><span style="font-weight: bold;">n</span><span style="font-weight: bold;">def</span> CONFIG_NO_OPAL_TEST
        <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">Initialise OPAL message log interface</span><span style="font-weight: bold; font-style: italic;"> */</span>
        opal_msglog_init();
<span style="font-weight: bold;">        #endif</span>

        <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">Create "opal" kobject under /sys/firmware</span><span style="font-weight: bold; font-style: italic;"> */</span>
        rc = opal_sysfs_init();
        <span style="font-weight: bold;">if</span> (rc == 0) {
                <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">Setup dump region interface</span><span style="font-weight: bold; font-style: italic;"> */</span>
                opal_dump_region_init();
                <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">Setup error log interface</span><span style="font-weight: bold; font-style: italic;"> */</span>
                rc = opal_elog_init();
                <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">Setup code update interface</span><span style="font-weight: bold; font-style: italic;"> */</span>
                opal_flash_update_init();
                <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">Setup platform dump extract interface</span><span style="font-weight: bold; font-style: italic;"> */</span>
                opal_platform_dump_init();
                <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">Setup system parameters interface</span><span style="font-weight: bold; font-style: italic;"> */</span>
                opal_sys_param_init();
                <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">Setup message log sysfs interface.</span><span style="font-weight: bold; font-style: italic;"> */</span>
                opal_msglog_sysfs_init();
                <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">Add all export properties</span><span style="font-weight: bold; font-style: italic;">*/</span>
                opal_export_attrs();
        }

        <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">Initialize platform devices: IPMI backend, PRD &amp; flash interface</span><span style="font-weight: bold; font-style: italic;"> */</span>
        opal_pdev_init(<span style="font-style: italic;">"ibm,opal-ipmi"</span>);
        opal_pdev_init(<span style="font-style: italic;">"ibm,opal-flash"</span>);
        opal_pdev_init(<span style="font-style: italic;">"ibm,opal-prd"</span>);

        <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">Initialise platform device: oppanel interface</span><span style="font-weight: bold; font-style: italic;"> */</span>
        opal_pdev_init(<span style="font-style: italic;">"ibm,opal-oppanel"</span>);

        <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">Initialise OPAL kmsg dumper for flushing console on panic</span><span style="font-weight: bold; font-style: italic;"> */</span>
        opal_kmsg_init();

        <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">Initialise OPAL powercap interface</span><span style="font-weight: bold; font-style: italic;"> */</span>
        opal_powercap_init();

        <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">Initialise OPAL Power-Shifting-Ratio interface</span><span style="font-weight: bold; font-style: italic;"> */</span>
        opal_psr_init();

        <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">Initialise OPAL sensor groups</span><span style="font-weight: bold; font-style: italic;"> */</span>
        opal_sensor_groups_init();

        <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">Initialise OPAL Power control interface</span><span style="font-weight: bold; font-style: italic;"> */</span>
        opal_power_control_init();

        <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">Initialize OPAL secure variables</span><span style="font-weight: bold; font-style: italic;"> */</span>
        opal_pdev_init(<span style="font-style: italic;">"ibm,secvar-backend"</span>);

        <span style="font-weight: bold;">return</span> 0;
}
<span style="font-weight: bold;">machine_subsys_initcall</span>(powernv, opal_init); <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">level: 4</span>

</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yang</p>
<p class="date">Created: 2024-05-22 Wed 16:46</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
